app/Http/Controllers/Auth/AuthenticatedSessionController.php

update `users` set `last_login` = '' where `user_id` <> 7
---
    public function store(LoginRequest $request): RedirectResponse
    {
        $request->authenticate();

        // Update last_login timestamp for the authenticated user
        /** @var User $user */
        $user = Auth::user();
        if ($user->is_suspended !== "مفعل") {
            Auth::logout();
            return redirect()->back()->withErrors(['email' => 'حسابك تم ايقافه']);
        }

        $user->last_login = now('Africa/Cairo');
        $user->save();