app/Http/Controllers/Auth/RegisteredUserController.php

insert into `users` (`name`, `email`, `admin`, `password`) values ('omarrashed hassan ali', 'e175ae0e2c@fireboxmail.lol', 'نعم', '$2y$10$obuWL09oaqr5AKbZhRoy/eu4z5TgkoPTGIslG9VfZs5R3LxjElPg2')
---
    public function store(Request $request): RedirectResponse
    {
        $request->validate([
            'name' => ['required', 'string', 'max:255'],
            'admin' => ['required', 'string', Rule::in(['نعم', 'لا'])],
            'email' => ['required', 'string', 'email', 'max:255', 'unique:'.user_table::class],
            'password' => ['required', 'confirmed', Rules\Password::defaults()],
        ]);

        $user = user_table::create([
            'name' => $request->name,
            'email' => $request->email,
            'admin' => $request->admin,
            'password' => Hash::make($request->password),
        ]);