app/Http/Controllers/Search_delete_updateController.php

    public function search(Request $request)
    {
        $file_query = $request->input('query');
        $user_query = $request->input('user_query');
        if (!empty($file_query) && empty($user_query)) {
            // Record the search in the track_user table
            $track = new track_user();
            $track->action = 'search';
            $track->user_id = Auth::user()->user_id;
            $track->search_input = $file_query;
            $track->save();
        } elseif (empty($file_query) && !empty($user_query)) {
            $track = new track_user();
            $track->action = 'search';
            $track->user_id = Auth::user()->user_id;
            $track->search_input = $user_query;
            $track->save();
        } elseif (empty($user_query) && empty($file_query) && $request->has('searched')) {
            $track = new track_user();
            $track->action = 'search';
            $track->user_id = Auth::user()->user_id;
            $track->search_input = "press search";
            $track->save();
        } elseif (!empty($user_query) && !empty($file_query)) {
            $track = new track_user();
            $track->action = 'search';
            $track->user_id = Auth::user()->user_id;
            $track->search_input = $file_query;
            $track->save();
---
insert into `track_users` (`action`, `user_id`, `search_input`) values ('search', 5, 's')
insert into `track_users` (`action`, `user_id`, `search_input`) values ('search', 5, 'm')
insert into `track_users` (`action`, `user_id`, `search_input`) values ('search', 5, 'press search')

            $track->action = 'search';
            $track->user_id = Auth::user()->user_id;
            $track->search_input = $user_query;
            $track->save();
---
insert into `track_users` (`action`, `user_id`, `search_input`) values ('search', 5, '2')


        if ($request->has('searched') && empty($file_query) && empty($user_query)) {
            // Display all files in the database
            $files = DB::table('files')->paginate(3);
        } elseif (!empty($file_query) || !empty($user_query)) {
            // Display relevant results based on input
            $files = DB::table('files')
                ->when(!empty($file_query), function ($query) use ($file_query) {
                    return $query->where('file_name', 'LIKE', '%' . $file_query . '%');
                })
                ->when(!empty($user_query), function ($query) use ($user_query) {
                    return $query->where(function ($innerQuery) use ($user_query) {
                        $innerQuery->where('user_name', 'LIKE', '%' . $user_query . '%')
                            ->orWhere('user_id', 'LIKE', '%' . $user_query . '%');
                    });
                })
                ->orderBy('file_name', 'asc')
                ->paginate(3);
---
select * from `files` limit 3 offset 0
select count(*) as aggregate from `files`
select * from `files` where `file_name` LIKE '%s%' and (`user_name` LIKE '%2%' or `user_id` LIKE '%2%') order by `file_name` asc limit 3 offset 0
select count(*) as aggregate from `files` where `file_name` LIKE '%s%' and (`user_name` LIKE '%2%' or `user_id` LIKE '%2%')

    public function destroy(files_table $file)
    {

        // Record the delete action in the track table
        $track = new track_user();
        $track->file_id = $file->file_id;
        $track->action = 'delete';
        $track->user_id = Auth::user()->user_id;
        $track->save();
---
insert into `track_users` (`file_id`, `action`, `user_id`) values (7, 'delete', 5)