app/Http/Requests/Auth/LoginRequest.php

    public function authenticate(): void
    {
        $this->ensureIsNotRateLimited();

        if (!Auth::attempt($this->only('email', 'password'), $this->boolean('remember'))) {
            RateLimiter::hit($this->throttleKey());

            throw ValidationException::withMessages([
                'email' => trans('البريد الالكتروني او رقم المرور غير صحيح'),
            ]);
        }
        $user = Auth::user();
        track_user::create([
            'user_id' => $user->user_id,
            'action' => 'login',
        ]);
---
insert into `track_users` (`user_id`, `action`) values (7, 'login')